OdDAI.Number.op_Implicit~System.Double
\details
operator double for the Number data type.
\returns double value if it placed at Number; otherwise, the method throw the exception.

OdDAI.Number.op_Implicit~System.Int32
\details
operator int for the Number data type.
\returns integer value if it placed at Number; otherwise, the method throw the exception.